<template>
  <div data-aos="fade-right" class="container">
   <div class="route-back">
      <router-link to="/">
        <span class="text-[13px] text-[#000000]">
      Главная страница

        </span>
      </router-link>
     <p>•</p>
     <button class="text-[13px] text-[#000000]" @click="router.go(-1)">
       Документы
      </button>
     <p>•</p>
     <p class="text-[13px] text-[#8F8F8F]">Лицензионный договор</p>
   </div>
    <h1 class="text-[41px] font-bold pb-[40px]">Лицензионный договор</h1>
    <div v-for="item in array" :key="item.id" class="license">
      <h2 class="text-[41px] text-[#383838] font-bold">{{item.title}}</h2>
      <p class="text-[18px] pt-[25px]">{{item.description}}</p>
      <p class="text-[18px] pt-[15px]">{{item.text}}</p>

    </div>
  </div>
</template>

<script setup lang="ts">
const router = useRouter()
const array = ref([
  {
    id: 1,
    title: 'Заголовок 1',
    description: 'Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. Тележка прекрасно подходит для использования во дворах многоквартирных домов, обработки территорий промышленных предприятий, востребована владельцами магазинов, различных коммерческих компаний. Кроме того, она может использоваться для высева семян на газонах, теннисных кортах и других территориях.',
    text: 'Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. '
  },
  {
    id: 2,
    title: 'Заголовок 2',
    description: 'Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. ',
    text: ''
  },
  {
    id: 3,
    title: 'Заголовок 3',
    description: 'Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. Тележка прекрасно подходит для использования во дворах многоквартирных домов, обработки территорий промышленных предприятий, востребована владельцами магазинов, различных коммерческих компаний. Кроме того, она может использоваться для высева семян на газонах, теннисных кортах и других территориях.',
    text: 'Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. '
  },
])
</script>

<style scoped>
.route-back{
  margin: 20px 0;
  display: flex;
  gap: 10px;

}
</style>